/*
SQLyog Ultimate v12.08 (64 bit)
MySQL - 5.5.28 : Database - solid
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`solid` /*!40100 DEFAULT CHARACTER SET gb2312 */;

USE `solid`;

/*Table structure for table `fleet` */

DROP TABLE IF EXISTS `fleet`;

CREATE TABLE `fleet` (
  `id` int(44) NOT NULL AUTO_INCREMENT COMMENT '主键ID',
  `number` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '编号',
  `license` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '车牌号',
  `official` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '供应商负责人',
  `telephone` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '供应商电话',
  `status` int(11) DEFAULT '0' COMMENT '当前状态（0：正常 1：关闭 -1：删除）',
  `memo` text COLLATE utf8_bin COMMENT '备注',
  `indate` date DEFAULT NULL COMMENT '添加日期',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

/*Data for the table `fleet` */

insert  into `fleet`(`id`,`number`,`license`,`official`,`telephone`,`status`,`memo`,`indate`) values (1,'DA02','07068','小明','18209040713',0,'~','2018-06-12'),(2,'HK02','07096','小红','18209040714',0,'aa','2018-06-12'),(3,'BC01','07069','小刚','18103065236',1,'aa','2018-06-12');

/*Table structure for table `goods` */

DROP TABLE IF EXISTS `goods`;

CREATE TABLE `goods` (
  `id` int(44) NOT NULL AUTO_INCREMENT COMMENT '货物主键',
  `number` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '编号',
  `name` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '商品名称',
  `address` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '供货商地址',
  `conversion` float(255,2) DEFAULT '1.00' COMMENT '换算单位',
  `price` float(255,2) DEFAULT NULL COMMENT '价格',
  `indate` date DEFAULT NULL COMMENT '插入日期',
  `status` int(44) DEFAULT '0' COMMENT '//当前状态（0：正常 1：关闭 -1：删除）',
  `memo` text COLLATE utf8_bin COMMENT '备注',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

/*Data for the table `goods` */

insert  into `goods`(`id`,`number`,`name`,`address`,`conversion`,`price`,`indate`,`status`,`memo`) values (1,'SS01','沙(SS01)','四十米场',1.00,12.12,'2018-06-12',0,'四十米场'),(2,'TW01','沙(TW01)','四十米场',3.40,80.00,'2018-06-12',0,'四十米场'),(3,'XD01','沙(XD01)','星都场	',1.00,0.00,'2018-06-12',0,'星都场'),(4,'111','zzz','桃尾场',1.00,222.00,'2018-06-20',1,''),(5,'aa','11','四十米场',1.00,12.00,'2018-06-20',-1,'');

/*Table structure for table `journal` */

DROP TABLE IF EXISTS `journal`;

CREATE TABLE `journal` (
  `id` int(255) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `person` varchar(256) DEFAULT NULL COMMENT '操作人',
  `time` datetime DEFAULT NULL COMMENT '操作时间',
  `type` varchar(256) DEFAULT NULL COMMENT '操作类型',
  `content` text COMMENT '操作详情',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=gb2312;

/*Data for the table `journal` */

insert  into `journal`(`id`,`person`,`time`,`type`,`content`) values (1,'name','2018-06-13 18:30:49','新增订单','订单ID:-1, 订单日期:\'2018-06-13\', 车队编码:\'1\', 车队车牌号:\'test\', 货物名称:\'1\', 供货单位名称:\'1\', 供货单号:\'1\', 计费数量:\'33.0\', 货物单价:\'11.0\', 货物金额:\'33.0\', 收货单位:\'1\', 收货方单号:\'44\', 收货方数量:\'11.0\', 收货方单价:\'11.0\', 收货方金额:\'11.0\', 吨位/方数:\'11.0\', 利润:\'111.0\', 备注:\'11\''),(2,'name','2018-06-13 18:32:01','修改订单','旧订单:订单ID:2, 订单日期:\'2018-06-13\', 车队编码:\'1\', 车队车牌号:\'test\', 货物名称:\'1\', 供货单位名称:\'1\', 供货单号:\'1\', 计费数量:\'33.00\', 货物单价:\'11.00\', 货物金额:\'33.00\', 收货单位:\'1\', 收货方单号:\'44\', 收货方数量:\'11.00\', 收货方单价:\'11.00\', 收货方金额:\'11.00\', 吨位/方数:\'11.00\', 利润:\'111.00\', 备注:\'11\'<br>新订单订单ID:2, 订单日期:\'2018-06-13\', 车队编码:\'1\', 车队车牌号:\'test\', 货物名称:\'1\', 供货单位名称:\'1\', 供货单号:\'222\', 计费数量:\'33.0\', 货物单价:\'11.0\', 货物金额:\'33.0\', 收货单位:\'1\', 收货方单号:\'44\', 收货方数量:\'11.0\', 收货方单价:\'11.0\', 收货方金额:\'11.0\', 吨位/方数:\'11.0\', 利润:\'111.0\', 备注:\'11\''),(3,'name','2018-06-13 18:35:25','修改订单','旧订单:订单ID:2, 订单日期:\'2018-06-13\', 车队编码:\'1\', 车队车牌号:\'test\', 货物名称:\'1\', 供货单位名称:\'1\', 供货单号:\'222\', 计费数量:\'33.00\', 货物单价:\'11.00\', 货物金额:\'33.00\', 收货单位:\'1\', 收货方单号:\'44\', 收货方数量:\'11.00\', 收货方单价:\'11.00\', 收货方金额:\'11.00\', 吨位/方数:\'11.00\', 利润:\'111.00\', 备注:\'11\'<br><br>新订单:订单ID:2, 订单日期:\'2018-06-13\', 车队编码:\'1\', 车队车牌号:\'test\', 货物名称:\'1\', 供货单位名称:\'1\', 供货单号:\'222\', 计费数量:\'33.0\', 货物单价:\'11.0\', 货物金额:\'33.0\', 收货单位:\'1\', 收货方单号:\'44\', 收货方数量:\'11.0\', 收货方单价:\'11.0\', 收货方金额:\'11.0\', 吨位/方数:\'11.0\', 利润:\'111.0\', 备注:\'1122\''),(4,'name','2018-06-13 18:37:19','删除订单','订单ID:2, 订单日期:\'2018-06-13\', 车队编码:\'1\', 车队车牌号:\'test\', 货物名称:\'1\', 供货单位名称:\'1\', 供货单号:\'222\', 计费数量:\'33.00\', 货物单价:\'11.00\', 货物金额:\'33.00\', 收货单位:\'1\', 收货方单号:\'44\', 收货方数量:\'11.00\', 收货方单价:\'11.00\', 收货方金额:\'11.00\', 吨位/方数:\'11.00\', 利润:\'111.00\', 备注:\'1122\''),(5,'name','2018-06-13 18:37:50','删除订单','订单ID:2, 订单日期:\'2018-06-13\', 车队编码:\'1\', 车队车牌号:\'test\', 货物名称:\'1\', 供货单位名称:\'1\', 供货单号:\'222\', 计费数量:\'33.00\', 货物单价:\'11.00\', 货物金额:\'33.00\', 收货单位:\'1\', 收货方单号:\'44\', 收货方数量:\'11.00\', 收货方单价:\'11.00\', 收货方金额:\'11.00\', 吨位/方数:\'11.00\', 利润:\'111.00\', 备注:\'1122\''),(6,'name','2018-06-13 18:38:06','删除订单','订单ID:2, 订单日期:\'2018-06-13\', 车队编码:\'1\', 车队车牌号:\'test\', 货物名称:\'1\', 供货单位名称:\'1\', 供货单号:\'222\', 计费数量:\'33.00\', 货物单价:\'11.00\', 货物金额:\'33.00\', 收货单位:\'1\', 收货方单号:\'44\', 收货方数量:\'11.00\', 收货方单价:\'11.00\', 收货方金额:\'11.00\', 吨位/方数:\'11.00\', 利润:\'111.00\', 备注:\'1122\''),(7,'name','2018-06-13 18:38:06','删除订单','订单ID:1, 订单日期:\'2018-06-04\', 车队编码:\'1\', 车队车牌号:\'07068\', 货物名称:\'1\', 供货单位名称:\'1\', 供货单号:\'0009211\', 计费数量:\'34.50\', 货物单价:\'100.00\', 货物金额:\'3450.00\', 收货单位:\'1\', 收货方单号:\'032600003\', 收货方数量:\'52.55\', 收货方单价:\'35.99\', 收货方金额:\'130.00\', 吨位/方数:\'11.00\', 利润:\'100.23\', 备注:\'s\''),(8,'name','2018-06-13 18:40:31','删除订单','订单ID:2, 订单日期:\'2018-06-13\', 车队编码:\'1\', 车队车牌号:\'test\', 货物名称:\'1\', 供货单位名称:\'1\', 供货单号:\'222\', 计费数量:\'33.00\', 货物单价:\'11.00\', 货物金额:\'33.00\', 收货单位:\'1\', 收货方单号:\'44\', 收货方数量:\'11.00\', 收货方单价:\'11.00\', 收货方金额:\'11.00\', 吨位/方数:\'11.00\', 利润:\'111.00\', 备注:\'1122\''),(9,'name','2018-06-13 18:40:31','删除订单','订单ID:1, 订单日期:\'2018-06-04\', 车队编码:\'1\', 车队车牌号:\'07068\', 货物名称:\'1\', 供货单位名称:\'1\', 供货单号:\'0009211\', 计费数量:\'34.50\', 货物单价:\'100.00\', 货物金额:\'3450.00\', 收货单位:\'1\', 收货方单号:\'032600003\', 收货方数量:\'52.55\', 收货方单价:\'35.99\', 收货方金额:\'130.00\', 吨位/方数:\'11.00\', 利润:\'100.23\', 备注:\'s\''),(10,'name','2018-06-13 18:47:41','删除订单','订单ID:2, 订单日期:\'2018-06-13\', 车队编码:\'1\', 车队车牌号:\'test\', 货物名称:\'1\', 供货单位名称:\'1\', 供货单号:\'222\', 计费数量:\'33.00\', 货物单价:\'11.00\', 货物金额:\'33.00\', 收货单位:\'1\', 收货方单号:\'44\', 收货方数量:\'11.00\', 收货方单价:\'11.00\', 收货方金额:\'11.00\', 吨位/方数:\'11.00\', 利润:\'111.00\', 备注:\'1122\''),(11,'name','2018-06-19 14:26:05','新增订单','订单ID:-1, 订单日期:\'2018-06-19\', 车队编码:\'BC01\', 车队车牌号:\'12231\', 货物名称:\'沙(XD01)\', 供货单位名称:\'星都场	\', 供货单号:\'1111\', 计费数量:\'2.0\', 货物单价:\'2.0\', 货物金额:\'2.0\', 收货单位:\'埔中央\', 收货方单号:\'2\', 收货方数量:\'2.0\', 收货方单价:\'2.0\', 收货方金额:\'2.0\', 吨位/方数:\'2.0\', 利润:\'2.0\', 备注:\'2\''),(12,'name','2018-06-19 14:29:19','修改订单','旧订单:订单ID:3, 订单日期:\'2018-06-19\', 车队编码:\'BC01\', 车队车牌号:\'12231\', 货物名称:\'沙(XD01)\', 供货单位名称:\'星都场	\', 供货单号:\'1111\', 计费数量:\'2.00\', 货物单价:\'2.00\', 货物金额:\'2.00\', 收货单位:\'埔中央\', 收货方单号:\'2\', 收货方数量:\'2.00\', 收货方单价:\'2.00\', 收货方金额:\'2.00\', 吨位/方数:\'2.00\', 利润:\'2.00\', 备注:\'2\'<br><br>新订单:订单ID:3, 订单日期:\'2018-06-19\', 车队编码:\'HK02\', 车队车牌号:\'12231\', 货物名称:\'沙(TW01)\', 供货单位名称:\'铁炉\', 供货单号:\'1111\', 计费数量:\'2.0\', 货物单价:\'2.0\', 货物金额:\'2.0\', 收货单位:\'埔中央\', 收货方单号:\'2\', 收货方数量:\'2.0\', 收货方单价:\'2.0\', 收货方金额:\'2.0\', 吨位/方数:\'2.0\', 利润:\'2.0\', 备注:\'2\''),(13,'name','2018-06-19 15:45:38','新增订单','订单ID:-1, 订单日期:\'2018-06-19\', 车队编码:\'HK02\', 车队车牌号:\'07096\', 货物名称:\'沙(SS01)\', 供货单位名称:\'星都场	\', 供货单号:\'111\', 计费数量:\'2.0\', 货物单价:\'3.0\', 货物金额:\'3.0\', 收货单位:\'埔中央\', 收货方单号:\'11\', 收货方数量:\'11.001\', 收货方单价:\'11.0\', 收货方金额:\'1.0\', 吨位/方数:\'111.0\', 利润:\'111.0\', 备注:\'1\''),(14,'name','2018-06-19 15:45:51','删除订单','订单ID:4, 订单日期:\'2018-06-19\', 车队编码:\'HK02\', 车队车牌号:\'07096\', 货物名称:\'沙(SS01)\', 供货单位名称:\'星都场	\', 供货单号:\'111\', 计费数量:\'2.00\', 货物单价:\'3.00\', 货物金额:\'3.00\', 收货单位:\'埔中央\', 收货方单号:\'11\', 收货方数量:\'11.00\', 收货方单价:\'11.00\', 收货方金额:\'1.00\', 吨位/方数:\'111.00\', 利润:\'111.00\', 备注:\'1\''),(15,'name','2018-06-20 14:59:24','新增订单','订单ID:-1, 订单日期:\'2018-06-20\', 车队编码:\'HK02\', 车队车牌号:\'07096\', 货物名称:\'沙(TW01)\', 供货单位名称:\'四十米场\', 供货单号:\'111\', 供货吨位/方数:1212\', 换算单位:3.40\', 计费数量:\'12.0\', 货物单价:\'11.0012\', 货物金额:\'12.0\', 收货单位:\'宝丽华\', 收货方单号:\'12\', 收货吨位/方数:\'123.0\', 收货方计费数量:\'132.0\', 收货方单价:\'123.0\', 收货方金额:\'123.0\', 利润:\'123.0\', 备注:\'\''),(16,'name','2018-06-20 14:59:49','新增订单','订单ID:-1, 订单日期:\'2018-06-20\', 车队编码:\'DA02\', 车队车牌号:\'12131\', 货物名称:\'沙(SS01)\', 供货单位名称:\'四十米场\', 供货单号:\'1111\', 供货吨位/方数:1\', 换算单位:1\', 计费数量:\'111.0\', 货物单价:\'11.001\', 货物金额:\'1.0\', 收货单位:\'宝丽华\', 收货方单号:\'1231\', 收货吨位/方数:\'111.0\', 收货方计费数量:\'11.001\', 收货方单价:\'11.0\', 收货方金额:\'1.0\', 利润:\'1.0\', 备注:\'1\''),(17,'name','2018-06-20 15:53:32','新增订单','订单ID:-1, 订单日期:\'2018-06-04\', 车队编码:\'HK02\', 车队车牌号:\'07096\', 货物名称:\'沙(TW01)\', 供货单位名称:\'四十米场\', 供货单号:\'123\', 供货吨位/方数:12\', 换算单位:3.40\', 计费数量:\'3.53\', 货物单价:\'80.0\', 货物金额:\'282.4\', 收货单位:\'宝丽华\', 收货方单号:\'13\', 收货吨位/方数:\'33.0\', 收货方计费数量:\'9.71\', 收货方单价:\'12.0\', 收货方金额:\'116.52\', 利润:\'-165.88\', 备注:\'aa\''),(18,'name','2018-06-20 15:55:28','修改订单','旧订单:订单ID:1, 订单日期:\'2018-06-04\', 车队编码:\'1\', 车队车牌号:\'07068\', 货物名称:\'1\', 供货单位名称:\'1\', 供货单号:\'0009211\', 供货吨位/方数:0.00\', 换算单位:1.00\', 计费数量:\'34.50\', 货物单价:\'100.00\', 货物金额:\'3450.00\', 收货单位:\'1\', 收货方单号:\'032600003\', 收货吨位/方数:\'11.00\', 收货方计费数量:\'52.55\', 收货方单价:\'35.99\', 收货方金额:\'130.00\', 利润:\'100.23\', 备注:\'s\'<br><br>新订单:订单ID:1, 订单日期:\'2018-06-04\', 车队编码:\'DA02\', 车队车牌号:\'07068\', 货物名称:\'沙(TW01)\', 供货单位名称:\'四十米场\', 供货单号:\'0009211\', 供货吨位/方数:11\', 换算单位:3.40\', 计费数量:\'3.24\', 货物单价:\'80.0\', 货物金额:\'259.2\', 收货单位:\'宝丽华\', 收货方单号:\'032600003\', 收货吨位/方数:\'11.0\', 收货方计费数量:\'52.55\', 收货方单价:\'35.99\', 收货方金额:\'130.0\', 利润:\'100.23\', 备注:\'s\''),(19,'name','2018-06-20 15:56:52','修改订单','旧订单:订单ID:1, 订单日期:\'2018-06-04\', 车队编码:\'DA02\', 车队车牌号:\'07068\', 货物名称:\'沙(TW01)\', 供货单位名称:\'四十米场\', 供货单号:\'0009211\', 供货吨位/方数:0.00\', 换算单位:1.00\', 计费数量:\'3.24\', 货物单价:\'80.00\', 货物金额:\'259.20\', 收货单位:\'宝丽华\', 收货方单号:\'032600003\', 收货吨位/方数:\'11.00\', 收货方计费数量:\'52.55\', 收货方单价:\'35.99\', 收货方金额:\'130.00\', 利润:\'100.23\', 备注:\'s\'<br><br>新订单:订单ID:1, 订单日期:\'2018-06-03\', 车队编码:\'HK02\', 车队车牌号:\'07096\', 货物名称:\'沙(TW01)\', 供货单位名称:\'一个测试的供货商2\', 供货单号:\'0009212\', 供货吨位/方数:12\', 换算单位:3.40\', 计费数量:\'3.53\', 货物单价:\'80.0\', 货物金额:\'282.4\', 收货单位:\'宝丽华\', 收货方单号:\'032600003\', 收货吨位/方数:\'8.0\', 收货方计费数量:\'2.35\', 收货方单价:\'35.99\', 收货方金额:\'84.58\', 利润:\'-197.82\', 备注:\'s\''),(20,'name','2018-06-20 15:58:14','修改订单','旧订单:订单ID:1, 订单日期:\'2018-06-03\', 车队编码:\'HK02\', 车队车牌号:\'07096\', 货物名称:\'沙(TW01)\', 供货单位名称:\'一个测试的供货商2\', 供货单号:\'0009212\', 供货吨位/方数:0.00\', 换算单位:1.00\', 计费数量:\'3.53\', 货物单价:\'80.00\', 货物金额:\'282.40\', 收货单位:\'宝丽华\', 收货方单号:\'032600003\', 收货吨位/方数:\'8.00\', 收货方计费数量:\'2.35\', 收货方单价:\'35.99\', 收货方金额:\'84.58\', 利润:\'-197.82\', 备注:\'s\'<br><br>新订单:订单ID:1, 订单日期:\'2018-06-03\', 车队编码:\'HK02\', 车队车牌号:\'07096\', 货物名称:\'沙(TW01)\', 供货单位名称:\'一个测试的供货商2\', 供货单号:\'0009212\', 供货吨位/方数:0.0\', 换算单位:12.0\', 计费数量:\'4.41\', 货物单价:\'80.0\', 货物金额:\'282.4\', 收货单位:\'宝丽华\', 收货方单号:\'032600003\', 收货吨位/方数:\'8.0\', 收货方计费数量:\'2.35\', 收货方单价:\'35.99\', 收货方金额:\'84.58\', 利润:\'-197.82\', 备注:\'s\''),(21,'name','2018-06-20 16:14:09','新增订单','订单ID:-1, 订单日期:\'2018-06-04\', 车队编码:\'HK02\', 车队车牌号:\'07096\', 货物名称:\'沙(SS01)\', 供货单位名称:\'四十米场\', 供货单号:\'aaaa\', 供货吨位/方数:12.0\', 换算单位:1.0\', 计费数量:\'12.0\', 货物单价:\'12.12\', 货物金额:\'145.44\', 收货单位:\'aaaaa\', 收货方单号:\'3333\', 收货吨位/方数:\'13.0\', 收货方计费数量:\'13.0\', 收货方单价:\'11.0\', 收货方金额:\'143.0\', 利润:\'-2.44\', 备注:\'111\''),(22,'admin','2018-06-20 16:31:57','修改订单','旧订单:订单ID:8, 订单日期:\'2018-06-04\', 车队编码:\'HK02\', 车队车牌号:\'07096\', 货物名称:\'沙(SS01)\', 供货单位名称:\'四十米场\', 供货单号:\'aaaa\', 供货吨位/方数:12.00\', 换算单位:1.00\', 计费数量:\'12.00\', 货物单价:\'12.12\', 货物金额:\'145.44\', 收货单位:\'aaaaa\', 收货方单号:\'3333\', 收货吨位/方数:\'13.00\', 收货方计费数量:\'13.00\', 收货方单价:\'11.00\', 收货方金额:\'143.00\', 利润:\'-2.44\', 备注:\'111\'<br><br>新订单:订单ID:8, 订单日期:\'2018-06-04\', 车队编码:\'HK02\', 车队车牌号:\'07096\', 货物名称:\'沙(SS01)\', 供货单位名称:\'四十米场\', 供货单号:\'aaaa\', 供货吨位/方数:12.0\', 换算单位:1.0\', 计费数量:\'12.0\', 货物单价:\'12.12\', 货物金额:\'145.44\', 收货单位:\'aaaaa\', 收货方单号:\'3333\', 收货吨位/方数:\'13.0\', 收货方计费数量:\'13.0\', 收货方单价:\'11.0\', 收货方金额:\'143.0\', 利润:\'-2.44\', 备注:\'1\'');

/*Table structure for table `order` */

DROP TABLE IF EXISTS `order`;

CREATE TABLE `order` (
  `id` int(255) NOT NULL AUTO_INCREMENT COMMENT '订单ID',
  `date` date DEFAULT NULL COMMENT '订单日期',
  `fleet_number` varchar(255) COLLATE utf8_bin DEFAULT NULL COMMENT '车队编码',
  `fleet_license` varchar(255) COLLATE utf8_bin DEFAULT NULL COMMENT '车队车牌号',
  `goods_name` varchar(255) COLLATE utf8_bin DEFAULT NULL COMMENT '货物名称',
  `supplier_name` varchar(255) COLLATE utf8_bin DEFAULT NULL COMMENT '供货名称',
  `supplier_certify` varchar(255) COLLATE utf8_bin DEFAULT NULL COMMENT '供货单号',
  `tonnage` float(255,2) DEFAULT '0.00' COMMENT '收货单位(吨位/方数)',
  `conversion` float(255,2) DEFAULT '1.00' COMMENT '转换单位',
  `goods_count` float(255,2) DEFAULT '0.00' COMMENT '计费数量',
  `goods_price` float(255,2) DEFAULT '0.00' COMMENT '货物单价',
  `goods_money` float(255,2) DEFAULT '0.00' COMMENT '货物金额',
  `receiver_name` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '收货方',
  `receiver_certify` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '收货方单号',
  `company` float(255,2) DEFAULT '0.00' COMMENT '单位（吨数/方数）',
  `receiver_count` float(255,2) DEFAULT '0.00' COMMENT '收货方数量',
  `receiver_price` float(255,2) DEFAULT '0.00' COMMENT '收货方单价',
  `receiver_money` float(255,2) DEFAULT '0.00' COMMENT '收货方金额',
  `profit` float(255,2) DEFAULT '0.00' COMMENT '利润',
  `memo` text COLLATE utf8_bin COMMENT '备注',
  `indate` date DEFAULT NULL COMMENT '增加日期',
  `status` int(255) DEFAULT '0' COMMENT '状态(0:正常  -1删除 )',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

/*Data for the table `order` */

insert  into `order`(`id`,`date`,`fleet_number`,`fleet_license`,`goods_name`,`supplier_name`,`supplier_certify`,`tonnage`,`conversion`,`goods_count`,`goods_price`,`goods_money`,`receiver_name`,`receiver_certify`,`company`,`receiver_count`,`receiver_price`,`receiver_money`,`profit`,`memo`,`indate`,`status`) values (1,'2018-06-03','HK02','07096','沙(TW01)','一个测试的供货商2','0009212',0.00,12.00,4.41,80.00,282.40,'宝丽华','032600003',8.00,2.35,35.99,84.58,-197.82,'s','2018-06-12',0),(2,'2018-06-13','1','test','1','1','222',0.00,1.00,33.00,11.00,33.00,'1','44',11.00,11.00,11.00,11.00,111.00,'1122','2018-06-13',0),(3,'2018-06-19','HK02','12231','沙(TW01)','铁炉','1111',0.00,1.00,2.00,2.00,2.00,'埔中央','2',2.00,2.00,2.00,2.00,2.00,'2','2018-06-19',0),(4,'2018-06-19','HK02','07096','沙(SS01)','星都场	','111',0.00,1.00,2.00,3.00,3.00,'埔中央','11',111.00,11.00,11.00,1.00,111.00,'1','2018-06-19',0),(5,'2018-06-20','HK02','07096','沙(TW01)','四十米场','111',0.00,1.00,12.00,11.00,12.00,'宝丽华','12',123.00,132.00,123.00,123.00,123.00,'','2018-06-20',0),(6,'2018-06-20','DA02','12131','沙(SS01)','四十米场','1111',0.00,1.00,111.00,11.00,1.00,'宝丽华','1231',111.00,11.00,11.00,1.00,1.00,'1','2018-06-20',0),(7,'2018-06-04','HK02','07096','沙(TW01)','四十米场','123',0.00,1.00,3.53,80.00,282.40,'宝丽华','13',33.00,9.71,12.00,116.52,-165.88,'aa','2018-06-20',0),(8,'2018-06-04','HK02','07096','沙(SS01)','四十米场','aaaa',12.00,1.00,12.00,12.12,145.44,'aaaaa','3333',13.00,13.00,11.00,143.00,-2.44,'1','2018-06-20',0);

/*Table structure for table `password` */

DROP TABLE IF EXISTS `password`;

CREATE TABLE `password` (
  `id` int(155) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `node` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '节点名称',
  `password` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '密码',
  `memo` text COLLATE utf8_bin COMMENT '密码信息描述',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

/*Data for the table `password` */

insert  into `password`(`id`,`node`,`password`,`memo`) values (1,'基本信息管理','25d55ad283aa400af464c76d713c07ad','供货商基本信息管理删除密码'),(2,'基本信息管理','21232f297a57a5a743894a0e4a801fc3','货物基本信息管理删除密码'),(3,'基本信息管理','e10adc3949ba59abbe56e057f20f883e','车队基本管理删除密码'),(4,'基本信息管理','21232f297a57a5a743894a0e4a801fc3','收货方基本信息管理删除密码'),(5,'订单管理','21232f297a57a5a743894a0e4a801fc3','订单详情删除密码'),(6,'系统管理','21232f297a57a5a743894a0e4a801fc3','用户信息管理删除密码'),(7,'系统管理','21232f297a57a5a743894a0e4a801fc3','用户信息管理重置密码');

/*Table structure for table `receiver` */

DROP TABLE IF EXISTS `receiver`;

CREATE TABLE `receiver` (
  `id` int(44) NOT NULL AUTO_INCREMENT COMMENT '主键ID',
  `supplier_name` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '供货商名称',
  `price` float(255,2) DEFAULT '0.00' COMMENT '收货单价',
  `supplier_address` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '供货商地址',
  `supplier_official` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '供应商负责人',
  `telephone` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '供应商电话',
  `status` int(11) DEFAULT '0' COMMENT '当前状态（0：正常 1：关闭 -1：删除）',
  `memo` text COLLATE utf8_bin COMMENT '备注',
  `indate` date DEFAULT NULL COMMENT '添加日期',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

/*Data for the table `receiver` */

insert  into `receiver`(`id`,`supplier_name`,`price`,`supplier_address`,`supplier_official`,`telephone`,`status`,`memo`,`indate`) values (1,'宝丽华',0.00,'哈尔滨','宝丽华','18236541245',0,'33','2018-06-12'),(2,'埔中央',0.00,'西二旗','德莱尔','18795231452',0,'11','2018-06-12'),(4,'aaaaa',11.00,'1','lili','18278768631',0,'1','2018-06-20');

/*Table structure for table `supplier` */

DROP TABLE IF EXISTS `supplier`;

CREATE TABLE `supplier` (
  `id` int(44) NOT NULL AUTO_INCREMENT COMMENT '主键ID',
  `supplier_name` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '供货商名称',
  `supplier_address` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '供货商地址',
  `conversion` float(255,2) DEFAULT '1.00' COMMENT '换算单位',
  `tonnage` float(255,2) DEFAULT '0.00' COMMENT '吨位/方数',
  `supplier_official` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '供应商负责人',
  `telephone` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '供应商电话',
  `status` int(11) DEFAULT '0' COMMENT '当前状态（0：正常 1：关闭 -1：删除）',
  `memo` text COLLATE utf8_bin COMMENT '备注',
  `indate` date DEFAULT NULL COMMENT '添加日期',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

/*Data for the table `supplier` */

insert  into `supplier`(`id`,`supplier_name`,`supplier_address`,`conversion`,`tonnage`,`supplier_official`,`telephone`,`status`,`memo`,`indate`) values (1,'四十米场','北京三里屯',2.00,0.00,'张三','18201016030',0,'第一个供货商','2018-06-12'),(2,'桃尾场','上海厂商',3.00,0.00,'李四','18209110713',0,'沙','2018-06-12'),(3,'铁炉','广州',4.00,0.00,'王五','18201016030',0,'备注一下','2018-06-12'),(4,'星都场	','test',1.12,0.00,'aa','18109876754',0,'1','2018-06-15'),(5,'aa','a',1.00,0.00,'aa','18109892841',-1,'1','2018-06-20'),(6,'一个测试的供货商','aaa',1.00,0.00,'一个负责22','18278768631',0,'1','2018-06-20'),(7,'一个测试的供货商2','aaa',1.33,11.00,'一个负责','18278768631',0,'1','2018-06-20'),(8,'test2','2',3.40,11.00,'aa','18278768631',1,'2','2018-06-20');

/*Table structure for table `user` */

DROP TABLE IF EXISTS `user`;

CREATE TABLE `user` (
  `id` int(255) NOT NULL AUTO_INCREMENT COMMENT '主键ID',
  `name` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '用户名称',
  `account` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '账号',
  `role` int(11) DEFAULT '0' COMMENT '角色类型（0：worker 1：viewer 2:admin）',
  `status` int(11) DEFAULT '0' COMMENT '状态（0：正常 1：关闭 -1：删除）',
  `password` varchar(256) COLLATE utf8_bin DEFAULT NULL COMMENT '密码',
  `memo` text COLLATE utf8_bin COMMENT '备注',
  `indate` date DEFAULT NULL COMMENT '新增日期',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

/*Data for the table `user` */

insert  into `user`(`id`,`name`,`account`,`role`,`status`,`password`,`memo`,`indate`) values (1,'我是管理员','admin',2,0,'21232f297a57a5a743894a0e4a801fc3','我是超级管理员','2018-06-12'),(2,'张三','develop',0,0,'21232f297a57a5a743894a0e4a801fc3','我只能看基本信息1','2018-06-12'),(3,'李四','test',1,0,'21232f297a57a5a743894a0e4a801fc3','我能看订单','2018-06-12');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
